Map<String, String> guess = {
  'content': '''
가정법

이글을 읽기 전에 현재완료를 먼저 읽고 오세요.

가정법은 ‘넋두리 화법’ 이라고 말할 수 있습니다.

어제 잠 안자고 공부를 조금만 더 했더라면, 오늘 시험을 더 잘 봤을 텐데…
그때 그녀를 그냥 보내지 않았더라면, 지금쯤 우리는 같이 행복하게 지낼 수도 있을 텐데…

동서양을 막론하고 사람이라면 누구나 이렇게 지나간 일에 대해 후회하며, 만약 어떠했더라면… 하면서 말을 할 때가 많죠.

가정법과거: 현재 사실에 반대되는 가정을 할 때 사용한다.
형식은 If + 과거형 동사, would +동사원형

이렇게 공식처럼 외워서 가정법 과거를 사용하라고 배우고 있습니다.
하지만 과연 그럴 필요가 있을까요?

If +과거형 동사가 나오는 것은 당연한 겁니다.
이미 지나간 일에 대해서 후회하고 아쉬워하는 내용이기 때문에, 과거 이야기를 들춰낼 수 밖에 없어요.
현재사실에 반대되는 가정을 하는데(말이 너무 어려워요... 그냥 지난 일 후회하는 겁니다.), 
왜 과거형 동사를 사용해야 되는 지 생각을 안하고, 그냥 문법대로 하려니
가정법의 문법이 이상해 보이는 것 뿐입니다.


내가 어제 공부를 열심히 했었더라면, If I studied hard yesterday, 이렇게 이야기 하지,

현재라는 시제.의 사실에 반대되는 가정을 한다고 해서,
내가 열심히 공부한다면  If I study hard,  이렇게 이야기 할 순 없잖아요.

가정법을 대할 때 일단, '가정'이라는 말을 버리고, 지난 일에 대한 '후회'라고 생각해야 됩니다.

오히려 If you go now, you can catch the train.처럼 
현재형 동사를 사용해서 '조건'을 다는 것이 '가정'에 가깝습니다.

학교에서 배우는 가정법(가정법과거, 가정법과거완료)은.. '가정'이라기 보다는 '후회'에 관한 이야기입니다.

후회법, 넋두리 화법은 과거일에 대한 후회, 아쉬움의 표현입니다. 그래서 과거일을 들출 수 밖에 없습니다.

If I studied hard yesterday, I would get a better score/ I should get a better score/ I could get a better score.

will, can은 좀더 확실한 추측이고,  이 조동사의 과거형을 써서 뉘앙스를 확 낮추어서 would could를  사용했습니다.


잠시 동사의 과거형과 현재형의 뉘앙스 차이를 살펴봅시다.
He was a spy.  vs. He is a spy.
그는 과거에 스파이였었다. (지금은 아닐 수도 있음)
그는 스파이이다. (지금 요원임)

The earth is round.
현재시제는 확실한 것, 불변의 진리를 표현할 때 사용합니다. 그래서 현재시제가 가장 강력한 표현법입니다.
그리고 A is B. 처럼 be 동사로 표현하는 것도 가장 강력한 표현 중의 하나입니다.
 

He is able to do that work.  그는 그 일을 해낼 수 있다.: 사실
He can do that work.  그는 그일을 해낼 가능성이 있다(가능성이 많다.) : 조동사는 추측같은 뉘앙스를 전달.

He was able to do that work. (과거에) 그는 그 일을 해낼 수 있었다.(그 일을 했다.): 사실
He could do that work. 그가 그 일을 할 수도 있을 듯…(can보다는 자신감이 떨어짐)
He could have done that work. (과거에) 그가 그 일을 했을 수도 있을 것 같기도 하고…(잘은 몰라) 

be동사의 경우에 과거형을 사용하면 표현력이 약화되듯이 ,
조동사의 표현도 과거형을 사용하면, 표현력이 약화됩니다.


be[not be] able to do는  능력이 있고 없고 (둘 중의 하나 입니다.)
can[could] do는 가능성(확률) 입니다. 
그래서 어제 내가 (어떤 상황 때문에) 학교에 갈 수 없어서 못갔다. 라는 [사실]을 이야기 할 려면,
I wasn't able to go to school.(못갔다.) 이라고 해야 되고,
I couldn't go to school.(학교에 갈 상황이 안되었었다. 갔는지 안갔는 안알려줌.) 로 하면 안됩니다.


I will visit New York tomorrow.   
이것에 대해 보통 미래시제라고 이야기 하지만… 실제로는 그냥 조동사 표현입니다.
미래시제는 마음속에만 있는 시제이고, 영어의 시제는 과거형동사, 현재형동사 두 가지로 표현해서, 과거시제와, 현재시제만 존재합니다.
I will visit New York tomorrow.는 내 의지를 이야기하는 겁니다. 
나 갈거야~~
의지를 표현하다보니, 저절로 ‘미래’의 의미가 나오는 거죠.

I'm visiting New York tomorrow. 해석: 나 내일 뉴욕 가(방문해). 
나는 방문중에 있다. 방문하는 절차를 계속 따라가고 있다. ⇒ 나 내일 뉴욕 가!
현재시제(am)로 이야기하는 것이 가장 강력한 표현법입니다. 
내가 내일 뉴욕에 가는 것이 이미 확정되어 있습니다.(현재시제로 표현)
뉴욕에 갈 마음을 정하고, 티켓도 끊어 놨고, 짐도 다 챙겨 놓았고, 내일이라는 시간을 향해, 뉴욕을 향해 지금도 저는 가고 있습니다.

I will visit New York은 아직 완벽한 준비를 마친 것이 아니고,
그래! 결심했어. 뉴욕에 갈거야(의지로 표현하는 미래). 라고 하는 말이고,
I am visiting New York.은 이미 뉴욕에 가기로 다 되어 있는 상황입니다. 
그래서 ‘나 뉴욕가(확정된 미래)' 식으로 번역하는 것이 적당합니다.


조동사를 살피느라 잠시 샛길로 빠졌었습니다.
다시 가정법으로 돌아갑시다.

If I were a horse, I would run fast.  
내가 말로 태어났더라면, 빨리 달릴 수도 있을 텐데..

If I were you, I would meet her.  
내가 너라면(너로 태어났더라면), 난 그녀를 만날 텐데…
If I were you, I could meet her.  
내가 너라면, 내가 그녀를 만날 수도 있을 텐데…


If he studied hard, he could pass the test. 그가 열심히 공부했더라면, 시험을 통과할 수도 있을 텐데…
여기서 잠깐!

우리가 가정법 과거라고 하면, 맨날 ‘현재 사실에 반대’라는 식으로 배워오니깐…
위의 문장들에서 ‘개념의 충돌’이 발생합니다.
If he studied hard, he could pass the test.   
이렇게 말했다면, 그는 반드시 시험에 통과하지 못한 걸까요?

아닙니다. 가정법 과거형태로 사용되었지만, 그가 시험에 통과했는지 못했는지는 이 글로는 알 수 없을 수도 있습니다.
이 글의 해석은, 그가 공부를 열심히 했더라면, 그가 시험에 통과할 수도 있을 텐데…. 
이 말뜻은, 지금 그는 공부를 열심히 하지 않은 상태라서, 시험에 통과할 가능성이 희박하다는 이야기 입니다.
시험에 통과하고 안하고는 이 문장만으로는 정확히 알 수 없습니다.
그가 공부를 열심히 했더라면, 그가 시험에 통과할 수도 있을 거야(지금처럼 가능성이 희박하지는 않을거야)

이것과 비교해서
가정법과거완료라고 이야기하는 문장을 살펴봅시다.
If he had studied hard, he would have passed the test.

이것을 가리켜 가정법 과거완료라고 말했지만,
If 조건절의 시제는, 가정법과거와 똑같은 과거시제입니다.  had(have) 강조요법의 동사를 사용한 것만 달라진 것입니다.

아유!! 그가 공부좀 열심히 했다면!!(강조해서 말하는 것입니다.),
[시험에 통과한 상태를] [갖고] 있을 텐데.=  분명 시험에 통과했을 텐데.


문장의 본 절에 시험에 통과하다(pass), 누굴 만나다(meet) 같은 행위의 동사는 ‘결과’를 만들어 내기 때문에,[통과하냐 안하냐? 만나냐? 안만나냐?]
그 결과에 대해서, 본격적으로(대놓고) 후회하고 찌질 댈 때에는 
가정법 과거보다는, 가정법 과거완료 형태로 잘 사용하는 경향이 있습니다.

이때 가정법과거완료도 특별한 시제가 아니라, have 동사가 들어간 강조요법일 뿐입니다.


이에 비해 문장의 본절에 be동사처럼 [행동의 결과가 없거나 결과가 중요하지 않은 동사]를 사용할 경우에는 
조건절이 had pp형태 이더라도(가정법 과거완료 형태이더라도), 
본절에서 would be ~~ , would 동사원형 형태로 잘 사용됩니다.
(이것을 가리켜 혼합 가정법이라고 부르지만... 이렇게 나눌 필요가 없습니다.)

If I hadn't missed the airplane, I would be in New York now.
아우! 증말! 내가 그 비행기를 놓치지만 않았어도…  내가 지금 뉴욕에 있을 수도 있는데….

If I hadn't met you, I would be happy now. 
너만 만나지 않았어도!!!, 내가 지금 행복할 수도….
If I had studied in America, I would speak English fluently.
미국에서 공부했었더라면, 영어를 유창하게 할 수도 있을 텐데… 


최종정리를 하면,
가정법과거와 가정법 과거완료에 대해서, 현재 사실에 대한 반대, 과거 사실에 대한 반대를 가정한다는 식의 공식으로 가정법을 바라보지 마시고,
그냥 현재 상황에 대해서, 넋두리를 한다는 생각으로 가정법 화법을 다시 바라보세요.

넋두리의 대상은 언제나 [과거 사건]입니다. 
현재 지금의 상황에 불만이니까 과거일을 들추면서 넋두리를 하는 것입니다. 그래서 가정법은 기본적으로 
'현재사실'에 대한 반대상황을 가정하는 것입니다.  
가정법과거는 현재사실에 대한 반대상황을, 가정법과거완료는 과거사실에 대한 반대상황을 가정하는 것이 아닙니다.
둘다 똑깥이 '현재사실에 대한 반대상황'을 가정하는 것입니다.

과거의 일에 대해서, had(강조욥법)를 사용했냐? 안했냐?의 차이만 있을 뿐입니다.

had를 사용하지 않는 경우에는 그냥 가볍게 말하는 넋두리이고, (내가 너라면, 내가 말이라면)
had를 사용한 경우는, 어떤 매우 아쉬운, 구체적인 [결과(시험에 떨어짐, 애인한테 차임)]등이 발생해서,
그것에 대해 강력히! 아쉬움을 토로하는 것입니다.(아오! 내가 그때 ~했었더라면!!)

이렇게 강조를 하고, 그 강조도 부족하다고 느끼면
Had it not been for ~, 처럼 Had(정말! 진짜루!)를 맨 앞으로 보내서(도치법) 표현합니다.


가정법이 대부분 과거일에 대한 후회를 하는 경우가 많지만, 반드시 후회만 하는 것은 아니죠.

Had it not been for Choco, we would have died!
= But for Choco, = Without Choco,
정말!! 초코가 없었다면(초코가 아니었다면, 초코가 도와주지 않았더라면), 우리는 죽었을 거야.

상황(it)이 초코를 가지고!! 있었다.(마침 초코가 있었다/나타났다.- 그래서 도와줬다.)


''',
  'content2': '''

''',
  'image1': '',
  'image2': '',
  'imgae3': '',
  'image4': '',
};
