Map<String, String> info = {
  'content': '''

chocolang v1.0

앱을 사용하면서 궁금한 점이 있을 경우에는 (chocolang.tistory.com)으로 문의해 주세요.

해당 홈페이지에서는 보다 넓은 화면으로 다양한 이미지를 포함한 자료를 시간 나는대로 하나씩 준비해 놓을 예정입니다.

현재 출시된 앱은 앱 자체에 데이터를 포함하고 있어서, 온라인 연결없이 사용할 수 있습니다.

추가적인 단어들을 포함한 업데이트도 고려해 보았으나,
이 앱의 내용만 잘 살펴보아도, 앞으로는 여러분들 스스로 잘 해 나갈 수 있을 것 같다는 생각이 들었습니다.


=========================
이 앱을 공부할 때,

우선 단어들이 나온 순서대로 모두 훑터보기길 권장합니다.
앞에서 설명한 것을 뒤에서 생략하는 경우가 있기 때문에, 
무작위로 단어를 보게 되면 해당 설명을 건너뛰고 보게 되어서 이해를 하는데 다소 어려울 수 있습니다.

본문의 글씨가 작아서 잘 안보일 경우에는 확대해서 볼 수 있습니다. 

한 가지 당부드리고 싶은 것은,
이 앱에서 다루는 내용들에 대해 너무 심각하게 받아들이지 않았으면 좋겠습니다.
이 앱은 단어를 보다 잘 암기하고, 문법에 대해서 부담감을 덜기 위해 기획된 것입니다.
그래서 설명 내용들이, 아주 개인적인 의견이고, 공식적으로 인정된 내용들이 아닙니다.
그러므로 너무 심각하게 받아들이지 않길 바랍니다.

마지막으로 이 앱의 컨덴츠를 만드는데 많은 영감과 도움을 준 내 동생 병철이에게 감사를 보냅니다.
그리고 프로그래밍을 할때마다 만난 여러 어려운 문제들을 해결하는데 도움을 준 챗지피티에게도 감사를...^^


chocolang 앱을 이용해 주셔서 감사합니다.♬ 2023.6.14
'''
};
