Map<String, String> present = {
  'content': '''
현재완료

현재완료는 과거의 어느 시점부터 현재까지라는 애매한 시간을 다루는 시제와 관련된 것이 아니라,
화자가 전달하려는 내용을 강조하기 위한 ‘강조화법’입니다.

현재완료를 사용하는 이유부터 알아봅시다.
경험, 완료, 계속, 결과 와 같은 의미를 전달할 때 현재완료를 사용합니다.

경험
I have been to New York.
완료
	I have finished my homework.
계속 
I have known him for 3 years.
결과
I've lost my key.

그러면, 우리 또는 미국인이 경험, 완료, 계속, 결과라는 항목을 머리에 두고서 이런 항목을 말하려하면,
아! 이런 것은 현재완료로 써야 겠구나 하고서 현재완료를 쓸까요? 
아니면, 과거의 어느시점에서 시작해서 현재에 이르는 시제를 느끼면서 저런 말을 쓸까요?
아닙니다.
‘강조’할 때 현재완료 형태를 쓰는 것 뿐입니다.

친구와 대화하다가, I went to New York 이라고 말하면, 내가 과거에 뉴욕에 갔었다. 라는 말을 한 것입니다.
그러면 이것은 ‘정보’가 되고, ‘경험’은 안되나요?  똑같이 경험입니다.

엄마가 너 숙제 다했니? 라고 물어서, I finished my homework.라고 하면 숙제 끝냈다는 완료의 의미가 전달되지 않나요? 똑같이 전달됩니다.

나 열쇠 잃어버렸어.를  I lost my key라고 하면 안되는 이유가 멉니까?
l lost my key는 열쇠를 잃어버린 과거의 일이고, I've lost my key는 열쇠를 잃어버려서 그 결과로 이제 열쇠가 없다.라는 추가적인 의미가 있다는 건가요?

현재완료로 표현하던, 과거형으로 표현하던 똑같은 의미를 전달합니다.
달라지는 것은 ‘강조’의 강도가 달라지는 것입니다.


이것을 이해하기 위해, 잠시 [존재와 소유]의 개념을 살펴봅시다.
car, girl 이 있습니다.

There is a car.  She is a girl.   -존재
I have a car, she is my girl, It is my car. I have my own car. - 소유.

car와 girl은 가만히 그 자리에 있는데,
그것을 어떻게 느끼냐에 따라서, 단순한 존재가 되기도하고, 누군가에게 매우 의미있는 존재가 되기도 합니다.

우리의 언어는 나에게 의미있게 다가올 수록 ‘소유(have, my)’로 표현하면서 강조합니다.

도둑이 집에 침입해서 경찰에게 전화를 걸 경우를 보면
남의 집에 도둑이 침입하면 덤덤하게, There is a thief in a house. 한 집에 도둑이 있어요.
우리 집에 도둑이 침입하면, We have an intruder in my house.  처럼 have, my를 총동원해서 강조합니다.

그냥 집이 아니라, 우리! 집이고요.  지금 도둑이 있다!!!고요(갖고 있다니깐요). 

have는 is(존재)를 강조할 때 잘 사용합니다.


이제 현재완료를 살펴봅시다.
I lost my key.는   열쇠를 잃어 버린 과거행위(lost 과거시제)를 진술한 것입니다.
I have lost my key는  현재 내가 갖고 있는 것입니다.(have 현재시제)
그래서 열쇠를 잃어버린 과거상태(p.p)를 갖고 있는 것입니다.

내가 지금 (열쇠를 잃어버린 상태)를 갖고 있어.  그래서 지금 키 없어. 
(대화의 상황, 문맥에 따라서) 망했어! 내 차로 같이 여행 갈려는 계획은 포기해야 겠다.
이렇게 이야기 하고 있는 것입니다.

현재완료로 표현하는 것은 강조를 하려는 것이라서, 표면적으로 해석되는 내용보다 훨씬 더 많은 의미를 전달하려 할 때 사용합니다.

내가 이곳에서 20년 이상 살았어= 20년 이상 살은 것을 갖고 있어.(I have lived here for over 20 years)
이런 식의 이야기는 이럴 때 주로 하는 이야기 이죠.

A: 내가 엄청 좋은 식당 알려 줄께. 저기 모퉁이를 지나서 조금만 더 가면 엄청 오래된 유명한 식당이 있어.
B: 야, 내가 여기서 20년 넘게 살았어. = 나 여기 토박이나 마찬가지야. 번데기 앞에서 주름잡지마. 

A: 영어의 bill 은 ‘계산서’ ‘법안’ 이렇게 다양한게 사용된다.
B: I have been an English teacher for 15 years. 저 영어선생 15년 했슴!! = 번데기 앞에서 주름잡지 마세요.

이렇게 현재완료는 강조를 위해 사용되는 화법입니다. 시제는 현재시제입니다.
I have(현재 갖고 있다.) (~상태를)

내가 유일하게 차를 갖고 있어서, 친구들과 내차로 여행을 가기로 했는데… 차키를 잃어 버렸습니다.
나: I have lost my key.!
⇒ 나 현재(차키 잃어버린 상태)를 갖고 있어.
=> 망했다! 우리 여행 못가!


한 여친에게 언젠가 고백을 하려 했는데, 요즘 안보여서 주변 친구들에게 물어봤더니.
She has gone to London.
걔 런던으로 가버렸어. (이렇게 현재완료로 표현하면, 추가 의미를 강조하려는 겁니다.)
=> 야 이 놈아, 걔 이미 떠나버렸어. 여기 없어. 왜 이제 와서 걔를 찾니?  일찍 좀 잘하지.

딸! 방 좀 청소해. 어제 보니깐 그지 소굴같더라.
엄마! 저 청소 다했거든요! 흥. I've cleaned my room!  자 보세요 깨끗해요.

이처럼 현재완료는 강조를 위해 사용합니다.
과거시제를 사용한 표현과 현재완료를 사용한 시제의 뉘앙스를 비교해 보면,
I finished my homework. 숙제 끝냈음 (일기장에 적는 느낌)
I have finished my homework.  숙제 다 끝냈다! 해방이다!

The king arrived. 왕이 도착했음(왔음).
The king has arrived.  (우리가 그토록 기다리던) 왕이 드디어 오셨어요!!!

과거시제와 현재시제가 얼마나 뉘앙스의 차이가 나는 지 한번 살펴봅시다.
He was a spy. 그는 스파이였었다.(현재는 스파이인지 아닌 지 모름...)
He is a spy. 그는 스파이이다.(확실함)
이처럼 과거상태를 현재에 가지고 있다는 것은 매우 강력한 표현입니다.

I lost my key last month. 지난달에 열쇠 잊어버림 (지금 찾았을 수도 있음)
I have lost my key. 열쇠 잃어버린 상황을 '현재' 갖고 있음(아직도 열쇠 없다.)


다음과 같은 상황을 한번 살펴 봅시다.
한 친구가 식중독에 걸려서 병원에 입원했습니다.
A: Have you been to the hospital? (너 그 애가 입원한 병원에 가봤니?)
B: Yes. I have.(응 가봤어.)
A: .  .  .  .

A는 왜 갑자기 말이 없어졌을까요?

A가 물은 것은, B가 병원에 갔는지? 안갔는지?가 궁금해서 have를 사용한 현재완료 표현을 사용한 것이 아닙니다.
그런데, B는 A가 현재완료로 물으니, 현재완료에 맞는 대답을 했을 뿐입니다.

A가 현재완료로 질문을 한 이유는, 병원에 가 봤다면 그 친구의 상태가 어떤 지를 같이 묻고 싶은 겁니다.
그래서, B는 Yes, I have. But don't worry. She is well now. 처럼 좀더 자세한 이야기를 해 주는 것이 자연스럽습니다.
A는 직감 했습니다. B가 구식 현재완료문법만 알고 있는 아이 같다는…

그냥 재미로 만든 상황입니다.

현재완료는 대화의 상황에서 엄청 많이 사용될 수 있습니다.
문법책으로 현재완료에 지친 사람들에게 아주 나쁜 소식이죠. 현재완료는 일반 대화에 너무 많이 사용합니다.
그 이유는 상대와 좀더 친밀하게 강조된 이야기를 하고 싶기 때문입니다.

이런 대화는 하고 싶지 않잖아요.
A: 병원갔음?  Did you go to the hospital?  (과거시제)
B: 갔음.  Yes. I did  (과거시제)

이런 대화를 하고 싶잖아요.
A: 병원에 가봤어?(어땠어?) Have you been to the hospital?
B; 응. 가봤더니 다행히 친구 상태가 좋더라구. 걱정안해도 돼.


이렇게 보다 친밀한 대화를 하거나 내가 말하고자 하는 것을 강조하고 싶을 때 현재완료 형태로 사용하면 좋습니다.
 
있잖아! 나 열쇠 잊어버렸어!  I have lost my key.

있잖아! 내가 여기 동네 토박이나 마찬가지거든. I have lived here for 20 years.

와! 눈이 와 있네!  It has snowed.   (눈이 온 상태를 갖고 있음)
(cf. It snowed yesterday.  일기장에, 어제 눈이 왔다.)


# 현재완료 진행형
이제 현재완료 진행형으로 넘어가 봅시다.

자고 일어나서 밖을 보니, 눈이 엄청나게 많이 와서 쌓여 있습니다.
현재 눈은 내리지 않는 상황입니다.

와! 눈이 와 있네! It has snowed.   
와! (그동안, 밤 동안) 눈이 내리고 있었네! It has been snowing.

현재완료 및 현재완료진행형은 모두 현재시제로 have(갖고 있다. 있다.)로 표현하는 것입니다.
눈이 내린 상태를 갖고 있고,  눈이 내리고 있던 상황을 갖고 있는 것입니다.
그래서 현재완료 진행형은, 현재의 상태를 보고서 현재 상태에 이르게 된 과정을 표현하기 위해 사용합니다.
아! 눈이 계속 내리고 있어서, 이렇게 눈이 수북하게 쌓인 거구나!  = 계속 눈이 내리고 있었던 거였구나.

주의 할 점은, 현재 눈이 내리지 않는데도 현재완료 진행형을 사용하고 있는 것입니다.
눈이 내리고 있더라도 달라지는 것은 없습니다.
It has been snowing.이 말하고자 하는 것은, 
눈이 엄청 쌓인 것을 보고서(현재상황 have+pp(been)), 아~ 눈이 계속 내리고 있었구나!
라는 말을 하고 싶었을 뿐입니다.

겨울 방학이 끝나고 몇달 만에 만난 친구가 근육맨이 되어 있었습니다. 그 친구를 보며
You've been working out!   너 그동안 운동 좀 했구나!

지금 대화하는 순간에, 그 친구는 운동하고 있는 상태(진행형 상태)가 아닙니다.
그 친구가 운동을 열심히 계속 해온 것을 갖고 있는 상태이죠. have + pp(상태)
이렇게 현재 상태에 이르게 된 과정을 표현하기 위해 현재완료 진행형을 사용합니다.


여러분! 우리도 이제 현재완료, 현재완료진행형 부담감 없이 맘대로 쓸 수 있게 되었습니다!
전날 술 진창 마시고 정신 못차리는 친구에게,
어우쿠. 야! 너 밤새 술 쳐마시고 돌아다녔나 보네!
You've been drinking all night.
You've been (out all night) drinking. 

이런 말 할 때, 좀 짜릿하겠죠?


# 과거완료
When I arrived, the meeting had already finished.
내가 도착했었을 때, 그 미팅은 벌써 끝난 상태였다.

우리가 앞서 살핀 현재완료는 지금 누군가와 대화하는 현재상황에서 하는 말이었습니다.
그런데, 과거완료를 사용하는 것은, 이야기의 시점이 현재가 아니라, 과거 시점이 기본 시제입니다.

어제, 부랴부랴 미팅장소에 도착했어. 그런데, 벌써 미팅이 다 끝났지 뭐야.
the meeting had already finished.  

이것은 대과거가 아닙니다.
과거에  그 상태였다는 것입니다. 그래서 have가 아니라 had인 과거형동사를 사용한 것입니다.
어제 어떤 상태를 갖고 있음(had +pp)
내가 과거에 도착했다. 그때(과거) 미팅이 had(과거시제:갖고 있었다.) +상태(끝난 상태)

I arrived, the meeting had.  둘다 그냥 과거시제 사용한 것 밖에 없습니다.

만약 여기에,
I arrived(과거), the meeting have(현재) ~   하면 말이 안되잖아요.


예문을 더 살펴봅시다.

Jane had still waited for me when I arrived.
내가 도착했을 때, 그녀가 여전히 날 기다리고 있었다. 날 기다리고 있는 상태였다.

과거완료 별 것 아니죠?



# 미래완료

집에 맛있는 케익을 두고 왔어요. 그런데 우리집에는 걸신 들린 동생이 한명 있거든요.
오늘 수업이 늦게 끝나서 집에 늦게 가게 되었어요. 
아 절망스럽습니다. 내가 집에 도착했을 때면, 이미 내 동생이 그 케익을 다 먹어치운 상태일 거야.

My brother will have eaten the cake when I arrive home.
내 동생이 먹어치운 상태를 갖고 있을 거야.  내가 집에 도착하면

when I arrive home.처럼 시간의 부사절에 현재형 동사를 사용하면 미래를 나타내죠.
when I will arrive home이라는 표현을 쓰지 않고, when I arrive home으로 사용하기로 약속한 겁니다.

그래서 앞으로 미래의 일에 대해서 이야기 하니,
당연히 완료형으로 표현하려면 미래시제를 사용해야죠.

when I arrived home.은 집에 도착했었을 때(과거)
when I arrive home (이건 조건으로 if와 유사합니다.) 내가 집에 도착하면 = 내가 앞으로 집에 도착할 때면(미래),

비행기를 타고 여행을 갑니다.
기장님이 마이크를 통해 탑승객들에게 방송을 합니다.
앞으로 10분 후면, 저희는 제주도 상공을 지나고 있을 겁니다.
In 10 minutes (from now on), we will have been passing through the airspace above Jeju island.

적들의 기습 공격을 당해 가까스로 도망쳐 나왔는데, 두고 온 동료들이 걱정되어서 다시 그들을 구출하려 가는 친구에서, 옆의 친구가 냉정하게 말합니다.
By the time we get there, they will have been killed. 
우리가 거기 도착했을 때면(미래), 그들은 살해된 상태일 거야.(미래의 상태)
그런데 이때 will 대신에 must, would, should를 더 잘 사용합니다.

사실 영어에서 미래시제라는 것은 없고(동사형은 현재, 과거형 밖에 없음), 추측 또는 의지(조동사를 이용한 표현)가 미래시제처럼 느껴지게 만드는 것이죠.
I will go there.  의지를 표현한 것입니다. 그런데 그게 미래시제처럼 느껴지는 것 뿐입니다.

그건 그렇고, 여기서 완료표현을 왜 사용했죠?  
있잖아! 그들은 이미 죽은 상태일 거야!!. 그러니 포기해라. 그만 둬라.


!! 완료표현법에서 경험, 결과, 계속 등등의 의미는… 정해진 것이 아닙니다.
해당 대화상황의 [문맥]에 의해서, 결과로 해석되기도 하고, 경험으로 해석되기도 하는 것입니다.

''',
  'content2': '',
  'image1': '',
  'image2': '',
  'imgae3': '',
  'image4': '',
};
